### Working on groupby

In [2]:
import pandas as pd 

data = {
    "Name" : ['Ram','Shyam','Hari','Ghanshyam','Sita','Gita','Rita'],
    "Electives" : ['Cyber Security','IS','Cyber Security','ML','ML','IS','IS'],
    "Gender" : ['M','M','M','M','F','F','F'],
    "Marks Scored" : [70,80,50,32,21,65,75]
}

df = pd.DataFrame(data)
df

        Name       Electives Gender  Marks Scored
0        Ram  Cyber Security      M            70
1      Shyam              IS      M            80
2       Hari  Cyber Security      M            50
3  Ghanshyam              ML      M            32
4       Sita              ML      F            21
5       Gita              IS      F            65
6       Rita              IS      F            75

In [13]:
# grouping by according to their choosen electives

electives_group = df.groupby('Electives').size()

electives_group

Electives
Cyber Security    2
IS                3
ML                2
dtype: int64

In [14]:
electives_group.count()

3

In [16]:
# Average marks scored based on the electives

averagemarks_elective = df.groupby('Electives')['Marks Scored'].mean()

averagemarks_elective

Electives
Cyber Security    60.000000
IS                73.333333
ML                26.500000
Name: Marks Scored, dtype: float64

In [17]:
averagemarks_electivegender = df.groupby(['Electives','Gender'])['Marks Scored'].mean()

averagemarks_electivegender

Electives       Gender
Cyber Security  M         60.0
IS              F         70.0
                M         80.0
ML              F         21.0
                M         32.0
Name: Marks Scored, dtype: float64

In [20]:
#  Aggregate Multiple Columns

multiple_columns = df.groupby('Electives')['Marks Scored'].agg(['mean','max'])
multiple_columns

                     mean  max
Electives
Cyber Security  60.000000   70
IS              73.333333   80
ML              26.500000   32

In [23]:
# use of reset_index

avg_marks_scored_gender = df.groupby(['Electives','Gender'])['Marks Scored'].agg(['min','mean','max']).reset_index()
avg_marks_scored_gender

        Electives Gender  min  mean  max
0  Cyber Security      M   50  60.0   70
1              IS      F   65  70.0   75
2              IS      M   80  80.0   80
3              ML      F   21  21.0   21
4              ML      M   32  32.0   32